portal /app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos"
---
  def index
      @photos = Photo.all

INSERT INTO "photos" ("attachment", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["attachment", "Screenshot_from_2016-07-17_16_33_36.png"], ["created_at", 2016-11-05 05:06:43 UTC], ["updated_at", 2016-11-05 05:06:43 UTC]]
---
   def create
      @photo = Photo.new(photo_params)

      if @photo.save