portal /app/controllers/students_controller.rb

SELECT "students".* FROM "students" ORDER BY created_at DESC
---
  def index
    @students = Student.all

INSERT INTO "students" ("name", "rollno", "branch", "created_at", "updated_at", "email", "phone", "gender", "category", "dob", "address", "high_school", "intermediate", "high_school_year", "inter_school_year", "diploma", "diploma_year", "diploma_percentage", "sem1", "sem2", "sem3", "sem4", "sem5", "sem6", "sem8", "average", "backlogs", "percentage_including_diploma", "ct_reference_no", "remarks") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30) RETURNING "id"
---
  def create
    @student = Student.new(student_params)



    respond_to do |format|
      if @student.save

UPDATE "students" SET "category" = $1, "dob" = $2, "updated_at" = $3 WHERE "students"."id" = $4  [["category", "Gen"], ["dob", Sun, 06 Jul 1986], ["updated_at", 2016-07-07 06:11:54 UTC], ["id", 4]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)